[{ "id": 4, "author": "Veyhunk", "title": "交互设计需求分析", "description": "需求分析的三个阶段, 需求分析应注意事项. ", "imageURL": "images/1.jpg", "text": "在产品的需求里面，经常有这三个概念：业务需求、用户需求、功能需求，但往往，我们很容易搞混，不清楚他们之间的关系和差异，我们先引用一下比较官方的解释：\n业务需求（ Business requirement ）表示组织或客户高层次的目标。业务需求通常来自项目投资人、购买产品的客户、实际用户的管理者、市场营销部门或产品策划部门。业务需求描述了组织为什么要开发一个系统，即组织希望达到的目标。\n用户需求（ user requirement ）描述的是用户的目标，或用户要求系统必须能完成的任务。用例、场景描述和事件――响应表都是表达用户需求的有效途径。也就是说用户需求描述了用户能使用系统来做些什么。\n功能需求（ functional requirement ）规定开发人员必须在产品中实现的软件功能，用户利用这些功能来完成任务，满足业务需求\n这个解释其实还是蛮明确的，其实理解这三者的关键点，是要先认清楚每个需求针对的对象不一样：\n•\t业务需求———对应的是组织或者客户，实质就是业务的建设方；你也可以类比房地产市场的开发商；\n•\t用户需求———对应的是使用产品的用户；你也可以类比买房的人；\n•\t功能需求———对应的是产品，即产品要具备怎样的功能，才能满足相应的业务需求和用户需求；类比房地产市场，那就是房子本身。\n类比成房地产三个角色后，你发现，开发商通常的诉求是想多赚钱，买房的人诉求是买到物有所值，甚至物超所值的房子；但不管二者怎么想，最终都是需要通过房子来实现，必须建设的房子的属性达到某个标准才能满足二者的诉求；\n所以，这么一看，你就明白了，其实这三者之间的关系是：\n \n即，业务需求和用户需求，只有经过需求分析的转化，变成产品的功能需求后，才能得到实现。\n需求实例\n接下来，我们用一个简单的实例来进行说明：\n案例：用户自助寄件的需求\n业务建设方：某快递公司\n需求描述：目前很多城市的小区都已经有了快递柜，但快递柜主要是用于送件使用，而对于快递公司收件，用得比较少，某快递公司，就希望利用快递柜，来实现用户自助寄件的需求。\n首先，我们来分析其业务需求\n这个案例的业务建设方是：快递公司，其业务需求也很明确，就是：用户自助寄件。\n业务方之所以要建设这个需求，其目的是：希望利用快递柜，实现更高效的收件服务，减少人工上门收件的等待、低效、人力投入成本高等问题。\n其次，我们来看用户需求\n这个案例的用户，就是每一个要寄快递的人，那么他们的需求是什么了？\n他们的需求，其实就是在进行“自助寄件”的过程中，你尽量让我简单、易用，高效、快捷。\n接下来，我们进行需求分析的转化\n需求分析的转化，核心是两个点，一是对这个业务的场景进行充分的理解和认知，二是想明白业务场景中需求点，要通过何种方式来满足它。\n业务需求是“用户自助寄件”，这个业务要实现，我们结合寄快递的实际场景，其实还是蛮容易就能想到，有3个关键环节：\n1.\t用户要填写单据：即填写收发件人的相关信息；\n2.\t用户要能找到周边的快递柜，并且能打开它；\n3.\t还需要进行计量、支付快递费的问题\n这三个环节，基本把这个业务的三个关键阶段说明出来了，它就是：填单——>找柜子放件——>支付。\n然后，逐一对三个阶段进行具体的分析：\n填单阶段：\n•\t业务方需求：必须收件人、联系电话、寄件人信息清楚、明确等等。\n•\t用户需求：能选的就选，能简单填写的就简单填。\n转化为功能需求，你发现，无非是通过表单形式让用户把相关信息填上来，而为了满足用户需求，你肯定需要设计对收件人的记忆功能，让用户填写一次，后续每次只需要选择而已（相关的细节还很多，这里只做举例）。\n找柜子放件阶段：\n•\t业务需求：把最方便最合适的柜子告诉用户，并确保用户能安全、准确的找到快递柜、放入快递件；\n•\t用户需求：我就想知道我要把快递件放到哪里，别让我多走；\n这个业务需求和用户需求说起来简单，转化成功能需求时，其实里面还蛮多细节的：\n1.\t位置服务肯定需要，一是为满足发现柜子的需求，二是也有导航的需求；\n2.\t如何打开柜子呢？从我们的产品经验或者竞品参考来看，可以有扫描开启、验证码等方式；\n3.\t如何保证用户去到快递柜，一定就有其空的柜子可以给他放了，这里面就涉及一个快递柜忙闲资源的管理；\n所以，这里转化为功能需求时，你发现：有位置服务功能、扫描开启/验证码开启功能，柜子资源分配管理功能等；\n支付阶段：\n•\t业务需求：根据收费标准，准确无误、及时收到用户快递费。\n•\t用户需求：支付方便。\n•\t功能需求：\n1.\t如何来计量，由于是自助寄件，称重显然不合适，那么按体积是一种较简便的方式，而如何按体积了，其实根据可快递柜的柜子；\n2.\t如何支付，这个还简单，可以使用比较常用的几种支付方式就好；\n以上，都只是简单的需求分析和转化的过程，实际的需求过程中，我们经常讲需要结合业务场景、用户场景把一些关键细节挖掘出来，并能在产品设计时考虑进去，以给用户一个良好的体验。\n业务场景细节的挖掘\n比如：在上面的开启柜子的方式中，到底用扫描开启还是验证码的方式呢？\n其实用“验证码开启”会更合适，因为会存在很多这样的场景，某个寄快递的人，刚好家里有人下楼，或者认识的邻居下楼，而快递柜就在小区门口，那么找人代劳一下放件是一种很正常的事情，那么这时候，使用验证码就是一种最合适、简便的方式。\n又比如：某用户希望自己的快递能更快的被寄出去。\n那么，如果在给用户呈现周边分布的快递柜的同时，还告诉用户，该快递柜的收件时间，目前快递员的分布位置，是不是能让用户更好的去选择呢。\n这样的细节还很多，需要在实际分析中，更好的去理解用户场景、挖掘细节，并逐步的完善。\n通过上面的分析，我们发现，只要你充分认清楚业务需求方的诉求、用户在执行具体任务时的诉求，并对产品的常规实现方式有了解的话，需求分析并不是一个多复杂的过程，就是这么一步步去推理、去转化的过程。\n而要把每个细节做透，就必须在实际中多去磨练，在生活中多体验，学会场景化的思维方式。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 4, "author": "Veyhunk", "title": "网页设计中的配色问题", "description": "网页内容与色彩的联系, 色彩传达的情感问题", "imageURL": "images/2.jpg", "text": "身为网页设计新手的你，是不是还在纠结于你制作的网页找不到一组完美的配色方案？在本教程中我们将与你分享6条肯定会火，并且“错不了”的指导方针，你可以按照这些原则把握最基本的色彩规律。现在我们分享的这些原则都不是规则，你会在你的职业生涯中创造出更多的配色方案。相反，他们是一个起点，是你如何生存在网页设计领域色彩方向的安全指南。\n一、需要配色的是你的画布，而不是你的图片\n一个在网页设计中最根本的原则是，无论你花了多少时间创造了一个辉煌的设计，其最终的作用是发挥出内容的核心位置。你的配色方案永远不应该比它呈现的内容的更加“响亮”。你的设计应该是在后台，目的是帮助突出网站的内容。\n   \n淡色的画布突出了图像，而明亮的画布反而不能突出你的内容。（别笑，后者是发生在网络上的真实案例^—^）\n用Photoshop或者Sketch等软件设计网站的时候，创建设计的过程往往是相互独立的。有些设计单个看起来很不错，也能被你的客户所接受，但是当它真正被设计成网页的时候不适当的配色往往会分散访客的注意力。事实上，网页设计的过程是和内容紧密相连的，很多制作高品质的网页看上去空空荡荡，几乎没有内容。\n这是一个伟大的想法：你可以在你的网站上先铺陈出你的内容，用设计软件也好用代码也好，然后在你内容的周围设计你的网页。当然这也是一个特殊情况，如果一个特定风格的图像和照片都能和你的设计和谐的融为一体，那么你的设计配色才算是完美。试想一下，网站的配色对内容而言就像衣服对于人的重要性，对此你必须制定一套完美的并且合身的衣服。\n二、选择简单的灰色作为你网站的基调\n你可以为你的网站基调选择无数种颜色，不过我建议你采用最简单的颜色，比如白色/浅灰色与深灰色的搭配文字背景。\n你可以看看任何热门的网站、模版、主题，白色或浅灰色与深灰色搭配成了大多数的选择，这当然也是有充分理由的。这样的搭配对访客而言提高了你内容的可读性，并且把你的图片突出在最前方。\n \n一般来说，你的文字最好避免使用墨黑色，深灰色一般更容易阅读。我们提供一个比较舒服的文字颜色范围：＃333333到＃666666。\n对于你的背景色，全白色（#FFFFFFF）是可以搭配任何文本的最安全的颜色。如果你想选用其他的背景颜色，我们建议采用#FFFFFF到#CCCCCC\n当然，这些颜色的选择都不是固定死的。只不过如果你是新手，以上的配色方案你可以放心使用。\n三、只选择一种颜色突出显示\n如果你选择好几种不同的色调来，那么你的配色方案绝大多数是有问题的。你颜色用得越多，你的页面就越来越难以控制。所以，在你网页以灰色基调的前提下，你最好只选择一种鲜艳的颜色来作为你想要突出的事物，比如标题、菜单、按钮等等。你的高亮颜色可以是蓝色、红色、绿色，等等。\n你最好选择与你的基调颜色相关的高亮颜色。打开你的颜色选择器，并单击你彩色方块的中心。\n \n向上或向下移动你的滑块，你可以仔细选择你认为最合适的颜色。\n \n现在，你设计的页面有了三个基本的颜色：背景色、文本色和高亮色。在以后你也可以选择一种以上的高亮色，但现在对于新手的你来说还是选择一种比较合适。你现在已经掌握了基本的配色，如果你有信心，你以后还可以尝试更多种不同的方案。\n你刚刚学到：\n学会了如何选择“色相”。概括来说，色相是基本色，当你移动滑块，你会看到h值在颜色选择器中的变化。\n“H”代表色相，一旦你选择了你的高亮颜色，文本框中显示的就是你当前颜色的色相。\n四、如果有疑问，请使用蓝色\n如果你对你的高亮色的选择有疑惑的话，不妨使用蓝色。蓝色是一种弹性比较大的颜色，可以和很多种颜色搭配。黄色和紫色也很不错，但是如果使用不当会适得其反。\n另一方面，如果你是用蓝色，那么你用错颜色的概率就会很低。如果你正犹豫着不知道用什么颜色好，不妨使用蓝色。比较安全的蓝色包括从H235到H190，从海军蓝到深蓝色。\n \n如果是我的话，我通常选择H205的蓝色，如果你选定了一种颜色作为你的高亮色，那么也请你在其他需要的地方使用这种颜色。如果你的按钮、标题等需要高亮，把它们的颜色也换成同一种蓝色。在下面这个例子中我把白色换成了蓝色。\n \n五、给你的高亮色增加变化\n你一旦选择了高亮的颜色，从该点移动滑块来选择接下来的颜色。在你的设计中也需要其他的颜色，高亮色的稍微变化会让你的颜色选择变得简单。\n \n使用这些类型的颜色变化的东西，如：\n悬停效果：\n \n边界：\n \n通过突出显示颜色：\n \n渐变：\n \n光影效果：\n \n六、尽量不要使用颜色选择器右上角的颜色\n颜色选择器的右上角是一块肥沃的土地。在右上角的颜色就像F1赛车; 他们可以执行出惊人的效果，而且非常诱人，但通常想用好需要大量的经验。如果没有这种经验，他们可能会导致事故的发生，所以最好以削弱你的颜色，最好都保持比较淡化的色彩。\n这就是为什么在本教程的第三部分，我问你点击的颜色在地图右上角的中心选择您的高亮颜色之前，要确保你有一个比较柔和的颜色拉开序幕。\n为了说明这一点，看如果我只是改变了我们设计的色调，到目前为止，会发生什么。\n \n看上去还是听舒服的对吧？但是如果你把颜色调整为选择器右上角的颜色，我们再来看看效果如何：\n \n分分钟亮瞎了访客的双眼！如果你想确保你不烧焦你的访客的视网膜，遵循留出颜色选择器的右上角的格子的一半原则。\n饱和度和亮度\n当您拖动周围的颜色选择器区域的地图区域，你会看到“S”和“B”的值发生变化，这代表饱和度和亮度。您还可以看到色相号保持不变。所以，你通过改变你原有的色相的饱和度和亮度会产生颜色的变化。\n \n饱和度\n是一种生动的色彩表现。例如，认为“我的衬衫中渗透着葡萄酒红”。在一个典型的颜色选择器饱和度是多少白了就是混在你的基地的色调来决定。白色越少，越饱和。\n当您拖动到右边的颜色在地图上可以减少白色量，从而增加了饱和度，“S”的值上升。当您拖动到左边向所有的白角，你会减少饱和使“S”的值下降。\n \n亮度\n亮度是有多少黑色混合到你的颜色。黑色越少，越亮。\n当你拖动滑块向上，减少了黑色的数量，增加亮度，在颜色选择器中的“B”的值上升。\n \n与你原来的色调混合的黑色也被称为创造了“阴影”。这也来源于油漆混合，是黑色油漆与涂料颜色的混合。\n当你混合灰色到彩色这被称为创造了色调。如果你调节饱和度和亮度，那么你就创造了一种色调。所以基本上任何时候无论你的饱和度和亮度均小于100％，这就是一个色调。\n同样，这个词来源于油漆混合，在其中创建一个灰色的油漆，然后用彩色涂料混合。\n单色配色方案\n单色的配色方案是，你以一个基本的色调和扩展它的色相，饱和度和亮度。因此，通过采摘一大亮点的颜色和它创造的变化，你实际上创建了一个单色方案。\n \n下一步？\n坚持练习对灰度基础的单色配色方案，直到你感到很有信心为止。试着用不同的色调，尝试创建不同的高亮色，看看它是如何改变饱和度和亮度的设置，直到可以使用为止。\n当你感觉很舒服，可以增加一个额外的高亮颜色。我建议尝试橙色和蓝色，因为他们往往是最简单的二重奏。然后尝试绿色和蓝色，这在我的经验中是第二个最简单的。这两种往往是与客户和访客都会称赞的搭配。\n为了推动了你对Web的配色方案的理解，最好的事情就是抓住自己喜欢颜色，你可以用取样器（浏览器扩展Colorzilla），并用它来研究经验丰富的设计师是怎么做到的丰富的色彩搭配的。当你在浏览互联网的时候，看到一个很大的配合突破，你可以用颜色取样器看看在页面上使用的颜色的配色方案。你甚至可以尝试每个色相，看看哪些饱和度和亮度水平效果最好吧。另外要注意它的颜色组合的和谐度。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 4, "author": "Veyhunk", "title": "设计过程的头脑风暴", "description": "头脑风暴的方法, 头脑风暴开展的5个注意事项", "imageURL": "images/3.jpg", "text": "头脑风暴是一件很复杂的事情，可不是拉几个人来野蛮的讨论这么简单，是一件非常讲究科学方法的行为。虽然其实自己也早就了解过一些，但是总是嫌麻烦懒得去那么做。直到自己开始变忙，开始在意时间的投入和产出比时就会想着如何优化工作方法去解决问题。后来我又重新开展了一次“科学的”头脑风暴，看看我们是怎么做的吧：\n1，确定问题的关键词\n头脑风暴的开始可不能是“我想拉大家一起聊聊这个产品”这么简单，而是一开始就要定义一个明确的问题，一个头脑风暴讨论和解决一个问题。比如我不能说“我想让大家脑爆一下电梯怎么优化”，而是要说“我想让大家脑爆一下怎么解决高楼电梯中午太拥堵，要等太久的问题“。如果你对电梯的想法不止一个，下次再讨论就好了。但是如果你连电梯要解决哪些问题都不知道，那么就应该先自己整理一下现在使用电梯会遇到的常见问题再提出脑爆。\n当定义出问题之后，接下来就是给出脑爆的核心关键词。假设要“解决高楼电梯中午太堵”，你可能会冒出很多顾虑，比如不能成本太贵，乘客好接受，要减少占用面积，要有趣，要有科技感，不能破坏我厂高逼格的气质等等，这么多顾虑不可能全部抛出给参与者。所以一开始就要有一个属于自己的筛选，PASS掉大部分的顾虑，定两到三个最核心的关键词。\n如果自己是需求提出方，关键词就一定要自己来决策，如果像我这样只是个小交互或者只是个参与者，就应该找最上层的需求提出方（领导）让他给出关键词。关键词越多设计方案越难，所以一定要死皮赖脸的想办法定少一些。可以一开始把所有的顾虑都列出来，然后分个优先级，差不多类型的再合并，最终变成“能解决这三个问题我就差不多满意了”的姿态。\n另外讨论关键词的时候切记不要去讲解决方案，关键词的背后代表的是期望，脑爆还没开始前要先听听对方的期望是什么。\n2，尽量找不同的角色来参与\n假设我定的脑爆主题是：解决高楼电梯中午太堵等太久的问题\n给出的三个关键词是：成本低，乘客好接受，高逼格\n那我八成想出来的方案就是“装几面镜子”这么简单！可是作为一个有（xia）节（zhe）操（teng）的交互设计师怎么能就这样知足了呢？万一这个方案被拍死了怎么办？万一有更好的想法怎么办？这是最优解吗？所以必须头脑风暴！\n头脑风暴最好是拉一些背景差异比较大的人，因为如果大家都差不多可能想法就被限制了，提来提去总是装几面镜子。但是一定也有同学顾虑说万一差异太大提的想法不靠谱怎么办？其实这也没关系，因为头脑风暴的节奏是先发散后收敛，所以前期的目标是收集的想法越多越好，期间不要太考虑实现顾虑（当然也不能太离谱，提出用叮当猫的任意门这样的想法是应该被谴责的）。头脑风暴的发起者是整个过程的分析者，不要太在意大家怎么说只要你心中有谱就可以了，而且有的时候听到的”离谱“想法说不定会激发你自己的一些灵感。\n3，不批评不点评\n这个是头脑风暴最需要注意的，也是最容易失控的地方。之前和领导头脑风暴的时候大家说一个点子都会被领导说 ”哎呀你这个点子太扯了“，”哎呀小刘这个点子好“。一旦有批评，提出想法的人可能就会压抑自己，连他自己都相信自己有点不太靠谱了。而一旦有表扬，本来其他没什么感觉的人都越想越觉得这个点子好。这哪里是头脑风暴简直就是拍马屁大会啊！\n所以头脑风暴最重要的就是让大家无负担的表达自己的想法！最好都不要说话，免得互相影响。我们做头脑风暴的时候把三个关键词写在白板上，然后让参与的同学把想法写在小便签上贴在关键词后面（每个想法对应一个关键词）。\n \n这个发散的过程是需要控制的，比如让一个同学一开始只想其中一个关键词，如果15分钟后实在憋不出来了，就去想下一个。当3个关键词全部都想的差不多了，再互相看看大家的答案，然后看看自己还有什么补充的（不过这期间最好仍然不要说话）。\n4，维度分析\n通过上面的过程你的脑爆应该收集了贴满墙的点子了，但是你一看”哇靠这都是什么鬼！“，怎么去决定用采纳哪个方案呢？\n这个时候就要对脑爆的点子进行评估了，拉上做这个项目的设计师和产品经理，最好是大BOSS一起。每个关键词画一个象限表，纵轴叫做解决效果，横轴叫做实现成本，把这个关键词下面的点子往这个象限上贴。\n \n所以这个时候就需要点评和讨论每个点子了，你会发现有的点子很不错，很解决问题，但就是实现成本太高了（注意这里的实现成本绝不仅仅是指开发成本），有的点子很简单就可以做但是却没个什么卵用，所有脑爆的结果很直观的列在象限上。作为设计师，要找到的就是那些解决效果好，实现成本又不高的idea去指导设计。\n不过话说有时候我会发现一个点子不知道怎么分类怎么办，比如在电梯口展示”时尚产品的体验柜台“ 实现成本不高，大家喜闻乐见，逼格还挺高的，我应该归到那个关键词下面啊？别犹豫了同学，这是抽到了炸啊！当一个idea同时都满足所有关键词，且效果也不错实现成本低的时候，可能就是一个绝佳的解决方案。你只需要去看看是否有坑，然后快速推上线去实验一下效果就可以了。\n5，留作记录\n就像雷锋帮人都不忘记拍照一样，脑爆的过程一定要记录下来，最好是邮件全组或者让领导最后参与进来，好表现出你为了解决问题是多么的努力艰辛！（好吧这只是个玩笑，希望不要被我领导看见）\n把脑爆记录下来很有用，尤其最后分析环节对当下不太适合的点子，可能会对其他角色比如产品或运营同学有启发，又或者技术突破的时候不好的点子就变成了一个好点子，所以收集到的这些脑细胞千万不要浪费。至于抄送全组还有一个很大的功效就是要告诉大家：如何用正确的姿势做头脑风暴啊！！！", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 5, "author": "Veyhunk", "title": "项目跟进中的7个建议", "description": "如何做好项目跟进, 项目跟进能给团队开发带来什么", "imageURL": "images/4.jpg", "text": "每个设计师都会遇到的问题就是「为什么不能用我喜欢的这个方案」，其实想让自己那个超级棒的想法得以落地，是需要一定技巧的。今天这篇好文来自网易云音乐的交互设计师，亲历经验教你解决这个难题。\n做人哪，最重要的是开心，工作也一样。作为一个设计师，若能带着一种愉快的心情工作，不但效率倍增，更能设计出有创造性的方案。\n但设计师天生是心思细腻且敏感的一群人，很容易因为工作中的一些事情而陷入负面情绪。“每一个设计师的背后都有一群指点江山的神”，相比于艺术创作，职场设计师的确会在工作中遇到很多限制，很多时候是带着一副苦逼脸在工作的，有种郁郁不得志的感觉。\n“为什么就不能用我喜欢的那个方案？”\n问题就在于，你喜欢。而你的上级是否允许一个你喜欢但他不喜欢的方案上线，这其中有很多哲学问题是你无法控制的。\n多年经验表明，这种气血郁结的状态除了影响自己的健康之外，就没什么好处了。在你变（随）成（心）老（所）板（欲）之前，还是应多反观自身，让自己变得更专业为上策。\n当你产生了一个想法后如何让它更好地落地？不妨从以下几个方面，看看自己是否有做到位：\no\t建立科学的预期\no\t准备好信心\no\t有具体可执行的方案\no\t要有前戏\no\t要有持久力\n\n建立科学的预期\n大多数的不快乐源于心里落差：自以为不错的一个方案，到了老板那里就被浇一头冷水，垂头丧气。但别误会，并不是说要一味地降低自己的预期。逃避抑或无法自拔，都不健康。核心是要建立科学的预期。\n自一个想法产生的那一刻起，它便自带一种属性，等待你去分析：这个想法是你自己觉得好（一种感受），还是真的好（科学道理）？这决定了你之后是要单枪匹马，还是可以借助外力推动。\n不妨把想法分为“容易落地型”和“不容易落地型”，它们各自具备一些特征。\n容易落地型（满足项越多越容易）：\n在业务发展方向范围内\n明显提升了用户体验\n有数据支撑\n解决了大量用户反馈的问题\n解决了老板反馈的问题\n对项目相关利益人士也有好处\n…….\n不容易落地型（满足项越多越难）：\n好看不（一定）好用\n比较少（创）见（新）的设计模式\n破坏了现有用户习惯\n很多情况没考虑到\n用户感知不明显\n产品优先级低\n开发性价比低\n和你一个team里的人都持有不同意见\n……\n这些特征则来自于你每一次成功或失败的经验或教训，因此它们是动态的。通常这种预判会随着你经验的积累越来越准确（所以多实践才能出真知啊）。对照一下，是不是有很多想法一不小心沦为了“不容易落地型”？\n容易落地的想法，站在你背后的是“一群人”。不容易落地的想法，支撑你的基本上就是个人影响力或地位，若你还什么都不是，那就做好前方路途艰险的准备吧。否则感觉，凭啥要听你的感觉？\n建立科学预期的另外一个目的，是要提醒自己对结果负责。一个“容易落地的想法”最终没落地，你应该好好反思为什么对自己那么没要求；一个“难落地的想法”，碰壁是意料之中的事，let it go，日后仍有机会曲线救国的。\n\n准备好信心\n这是一个哲学观点：只要你想做，没有任何人能阻拦你。我觉得大多数推不动的问题根本在于最后你自己对这个idea并没有十足的信心。\n试问信心从哪里来？来源于你对各种case的考虑周全程度，来源于你的知己知彼，来源于你多年苦心积累的专业影响力……这能怪谁呢，so请务必正视这些问题。\n有具体可执行的方案\n没有具体方案的idea都是耍流氓。见过太多场景“说得是没错啊但有更好的方案么”，也见过太多场景“听上去有点意思但一看具体方案好像也不怎么样么”。你是执行层啊，看不到具体可执行的方案你让老板同意个啥？\n排除根本性的理念不合，在你推出一个方案时，通常被老板一番连珠炮似地发问给说噎住了，怪谁呢，别以为老板没想过。\n若真想让一个想法落地，别只是想，动手画，越具体的方案越有说服力。也别光拿别的成功产品举例，你自己不走察一遍所有场景你永远不知道同样一个设计用到自己产品上会有什么问题。别光有理念不考虑实现细节，甚至到了后面成了甩手掌柜让别人来帮你填坑。种种虎头蛇尾的事件会让你在别人眼中的专业可信度直线下掉，下次还信你？\n要有前戏\n不要突然让别人接受你的一个观点，提方案也要讲究用户体验的。数据、用户反馈、竞品分析、新品分析、行业趋势、设计趋势……这些背景信息可能都是别人之前不了解的，需要一个接受和消化的过程。\n对于能推动自己想法落地的信息，需要提前、有计划地推送给相关人士。在这过程中，你也可以从别人的反馈中获得一些有价值的东西，让你的思考更完善。\n要有持久力\n设计师还是需要有祥林嫂精神的。那些难以落地的，但是自己认为对的东西，只能靠自己盯着。有持之以恒地推过自己的想法么：\n发了封邮件没回应就算了？\n群里讲过一次没人理就算了？\n和老板谈过一次谈崩了就算了？\n开发觉得性价比低不愿意做就算了？\n产品觉得优先级不高就算了？\n……\n人艰不拆，有时候光靠反复念叨都有一些幸运念成的。\n很多一开始被否定的想法都有翻盘的机会，但前提是机会来的时候你能立马调出你的记忆和具体方案。比如想优化某个小点，提了多次都是“产品优先级低”，但某天老板突然关注到这里并要求立刻改掉，那这个小点也就顺势变成了容易推动的类型。\n讲了这些，来提升下中心思想…你不可能永远只做自己认为对的事情，为了保证团队效率，你需要服从，但这并不影响你保持自身的清醒。也依然可以根据上线之后的反馈知道自己是对的，还是想多了，还是其实是自己错了。\n另外，即使没按照自己满意的方向走，只要你还是这个项目的设计师，就应该负责到底。在我还是实习生的时候，有一次当时的导师问我：“感觉你最近跟进这个设计有点怠慢？”“因为最终定的这个方向不是我喜欢的，所以他们想怎样就怎样吧。”“但这是你的工作。”我也不知道为什么这么简单一句话就被讲通了，然后便心平气和地去整理跟进后续的一些细节和体验。是不是“自己喜欢的就认真对待，自己不喜欢的就爱咋咋地”，也成了我衡量设计师是否专业的标准之一。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 7, "author": "Veyhunk", "title": "需求分析避免4个误区", "description": "需求分析过程中存在哪4个误区, 如何有效避免这4个误区", "imageURL": "images/5.jpg", "text": "说到“需求”，简简单单的两个字，却困扰了很多的设计师和产品经理。迷茫的设计师一边做一边猜，猜不对就改，改了还不对，回去再继续改。总会有人给你提各种各样的意见，你按他们的意见去改了，结果产品经理还是可能会拍桌子：完全不是我要的样子啊！\n从iPhone开始火了用户体验，用户体验又火了交互设计。但是很多人学习新东西还是喜欢找模板，生搬硬套。网上那些Axure教程都挺火的，各种屌炸天的五毛钱特效、动态面板，反正是应有尽有。\n我见过很多Axure软件操作的高手，他们画的原型看起来都很历害的样子。哎哟，还会动哦！但是当他们接到设计需求时，多数还是一脸茫然，或者总会遇到不断被要求修改修改修改这样的工作状态。\n我在面试的时候，像这种软件操作的熟练程度，一般是不看的。因为我要找的不是画原型和线框图的工人，而是有想法的设计师。\n \n不知道什么时候开始，多了一个我不是很喜欢的词：干货。什么是干货？就是听完一个讲座，或者看完一篇文章，得到一个回去马上就能使用的方法、技巧。比如我跟大家说，写文章的时候，你给标题加一个数字，对于提高点击率是有帮助的。就好像这篇文章的标题。哈哈哈哈。\n但是很可惜，我今天不是来分享干货的。 -_-凸\n我今天不会教大家怎么做需求分析，主题并不是“设计需求分析的4个技巧”。所以，只是想在这里跟大家分享一下，在我过去的工作经历当中，我做设计需求分析时，踩过哪些坑，也就是走过哪些误区，应该如何避免。这些坑，如果你也不幸踩过，可能你会感同身受；如果你还没踩过，要么是你太幸运，要么就是还没开始，总之该来的总是会来的。\n小技巧是很容易得到的，花点时间找一下就有了。但是，你能轻易得到的小技巧，别人也行啊。所以，小技巧算不上核心竞争力。建议大家回去还是要多啃几本专业的书，多做几个项目，又或是多找几个同行前辈交流交流，那样才扎实，才能得到真正是干货。\n要做好设计，就要搞清楚设计的需求。关于设计需求分析，的确是一门学问。在展开介绍几个误区之前，我想先跟大家说明一下什么是“设计需求”，这不是我自己创造的词汇。所谓设计需求，就是指需要设计师配合完成的需求，比如设计用户流程、用户界面这些都是设计需求。\n \n我认为一个产品的设计需求应该包括两个方面，一是业务，二是用户。所以，会同时包含业务目标和用户体验目标两个层面。符合设计需求的方案，一定是既满足业务目标，又满足用户体验目标的。 设计师在做需求分析的时候，第一个容易踩的误区就是：只关注用户需求，不关注业务目标。\n误区1：只关注用户需求，不关注业务目标\n在实际工作中，设计师接到的业务需求，大多数时候，可能都是类似这样的。比如，“把购买流程优化一下”、“课程页面加一个分享的功能”、“讨论区帖子要支持顶和踩”、“在消息中心提供清空操作”。说是需求，其实多半已经是一个解决方案了。完整的需求应该包含目标和期望，甚至是背景的描述。\n如果你只是想把这个工作任务快点完成，那么就会照着需求方的方案去做，完全不管背后的目标和期望。这样的事情做多了，充其量就是一个“努力的笨蛋”而已。这样很危险，对产品，对你个人来说，都很危险。\n对待业务需求，我们需要向对待用户需求那样，不断地问为什么。去了解原因、背景。比如，为什么要优化购买流程？现在的流程有哪些问题呢？我们的用户会分享什么样的内容到微信里边呢？做了这些事情，产品期望得到怎样的成果呢？并且，我们又要如何来衡量设计方案的效果呢？\n了解问题，往往比提供解决方案更加重要。爱因斯坦说：“如果让我1个小时解答一道决定我生死的问题，我会花55分钟来弄清楚这道题到底是在问什么。一旦清楚了它到底在问什么，剩下的5分钟足够回答这个问题。”\n了解问题，即知道了做这件事情的目的、原因、动机。目的通常是需求的出发点，而目标是期望的成果。之所以提出目的和目标两个概念，是因为现实中就是会有很多人把目的目标混淆。如果直接用目的来指导设计，是空的，不够具体，也可能和设计没有直接关系。比如，要达到“获得更多的注册用户”这个业务目的，只要多做做推广，多挂挂广告也是可以的。但“提高注册转化率”这个业务目标，就变得和产品设计有非常直接的关系了。\n对目标最有帮助的事情，就是最有价值的事情。设计前先确认清楚相关的目标和期望，先问问做这件事想要达到什么效果。如果想不清楚，就先花时间搞清楚，不要因为时间急就匆匆忙忙地开始。努力固然重要，但比努力更重要的，是走心和思考。思考是一件难度更高的事，所以许多人宁愿立马埋头苦干，任劳任怨，不愿意花时间多想。这种看似勤奋的行为，实质是懒惰的，懒到脑子都不愿意转一下。\n \n像提升PV、UV、用户数、转化率、留存率、活跃度这些，通常是产品类的业务目标。而像提高市场份额、百度排名这些则是市场类的业务目标。这些目标一方面来源于产品的定位、规划，以及业务目的；另一方面，这些目标也有可能来自于公司战略、用户的需求、数据的分析结果等等。\n作为设计师，我们不仅需要关注用户需求，还需要关注业务目标和相关的衡量指标，积极去思考如何将业务目标转化为用户行为。然后再去设计用户流程和界面。我们通过规划引导用户使用，来帮助产品达成目标。\n \n为了达成目标，通过设计需求的分析，给用户创造动机、排除担忧、解决障碍。其中，创造动机、排除担忧是为了让更多的用户有更强的意愿使用；解决障碍，是为了让用户的操作变得更加有效、高效、容易学习使用。只要我们完整思考了这三个方面的因素，就能够有效提升产品的用户体验，同时又能够帮助产品顺利达成业务目标。这是一件双赢的事情。\n用数据来监测产品，能让你了解到用户的使用情况，和产品的健康状态。数据和用户体验并不是对立的，如果产品的改进让用户觉得很有意义，那么数据指标自然就会上升；如果用户体验没有什么改变，就不能说你的改进很成功。\n数据目标可以让整个团队团结起来，大家围绕着一些清晰和有形的指标，各司其职。如果没有数据指标，就很难衡量。如果无法衡量，就无法增长。\n但是，数据没有办法告诉我们用户体验是否得到了改进。比如，你给消息中心增加了删除消息的功能，删除按钮的点击率很高，这并不能说明用户体验变好了。相反，很多用户删除了产品推送的消息，我们就需要好好想办法改进消息推送策略了。有些问题也不是光看数据就能发现的，比如你无法通过数据得知为什么有那么多人愿意彻夜排队抢购一只手机，因为品牌效应很难进行量化。所以，定性研究是一个非常好的补充。定量研究告诉你用户做了什么，定性研究帮助你搞清楚用户的感受，两者需要相辅相成。\n微信创始人张小龙在腾讯发表了一个内部演讲，说“KPI是副产品”，我非常赞同。好的用户体验超越用户期望，这种工作不是单靠KPI这种数据的东西可以指导的。团队首先应该有用户价值的导向，然后再来谈数据，谈KPI。KPI是副产品，但用好KPI并不会让团队辜负产品。\n当业务需求和用户体验取得了比较好的平衡时，我们设计的就是一个健康的、可持续发展的产品。这是一个系统的工作方法，也是所有设计师必需要掌握的技巧。更是设计师帮助产品、帮助自己实现价值的关键基础。\n业务分析的方法参见：《阿里干货！交互设计师如何进行业务分析？》\n误区2：需求分析是产品经理干的\n以前我曾经有过一段这样的工作经历：交互设计师如果觉得产品经理的需求不完整、不靠谱，就把需求打回去，要求产品经理重写。产品经理觉得交互设计师阻碍了产品的进展，交互设计师觉得产品经理需求不靠谱，相互埋怨。可是，没有谁是老板派来捣乱的，对吧？当两个角色相互不信任，就没有办法形成很好的合力。甚至，大家做这份工作都会觉得很吃力，工作体验很糟糕，更别指望能做出好的用户体验的产品了。\n到这里可能就有人就会说，那交互设计师和产品经理合二为一不就得了。可是我并不这么认为。在资源许可的情况下，我的建议是，交互设计师和产品经理两个角色还是分开设置比较好。因为设计师和产品经理的思维方式完全不同。\n \n设计师通常关注产品的实现层面，而产品经理通常关注产品的业务层面。业务层面的意思是，假如你是一个在线教育产品的产品经理，为了达到管理层制定的提升20%的用户活跃度这个目标，你最关心的并不是开发什么功能，要把界面做成什么样，而是思考怎么样筛选出一群人，让他们来建立学习的氛围。然后，再来制定一个个小目标和实现路径，协调各个专业领域的人来达成目标。\n所以，当产品经理在思考业务层的问题时，绝对不是功能是什么，界面应该做成什么样。而是思考如何打通业务、争取资源，建立产品的闭环，协调团队，帮助产品顺利达成目标。\n再具体一点的话，设计师和产品经理各自都会负责不同的事情。比如产品经理主要负责收集市场和用户的信息，确定产品的目标和方向；通过获取更多公司可用的资源，来制定实施路径和策略；通过协调不同的团队共同工作，促进目标达成。而设计师呢，主要职责是明确业务需求和用户需求，并确定相关衡量指标；通过提供可视化的解决方案供团队讨论决定，挖掘更多的可能性；通过建立和维护设计规范，来提升产品设计的品质和效率。\n总之，产品管理的目的，是为了让产品实现长期的用户和客户满意，保持市场竞争优势，把产品的商业价值发挥到最大。而交互设计的目的，是让产品和用户之间建立有机关系，有效实现用户目标和产品目标。两个角色有非常多的时候需要互补，但两个角色的思维方式完全不同，所以我的建议是交互设计师和产品经理两个角色还是分开设置比较好。\n对于设计师而言，如果你的工作是在产品经理确认需求之后才开始的，那么建议尽快调整过来。你应该在产品经理分析目标市场、思考产品策略的时候就开始介入，只有这样才能发挥设计的价值。在设计之前，对业务目标和用户体验目标的理解，不是别人可以代替你完成的。 很难想像，一个不了解需求的设计师，他能做出什么好设计。事实上，团队里每一个角色都需要理解用户需求，不只是产品经理、设计师需要。如果开发工程师不了解需求，没有提出问题，那么就会有更多的工作浪费。\n根据某些非官方渠道的数据统计，95%的产品团队没有设立专职的交互设计师，而70%的产品经理又是没有受过专业的交互设计训练的。所以，如果你的团队暂时没有交互设计师的话，也不要紧，设计需求分析的方法仍然有效。\n产品经理的需求该不该接？看这里：《交互设计师：帮你判断需求该不该接的五个小原则》\n误区3：把自己当成典型用户\n在工作中，当我们讨论用户需求时，常常会听到“我觉得”，而不是“我发现”、“我知道”。有的时候，我自己也避免不了，不自觉地就会这样描述：“我觉得用户不需要这个功能”、“我觉得用户会找不到”。\n我们也总是会听到建议说“你要去多体验体验这些产品”。可是，其实体验越深入，离典型用户就越远了。为什么呢？\n因为你的产品视角会阻碍你成为典型用户。并且，你根本就不是典型用户，你没有他的经历、没有他的想法、没有他的感受。尽管你可以假装成自己是用户，尝试用你的同理心，去感受、理解他们。但那样其实也顶多只是一个低成本，且效果一般的办法而已。\n人物角色其实是一个比较好的办法。人物角色，英文Persona，它是对目标群体真实特征的勾勒，是真实用户的典型。\n注意了，人物角色是真实用户的典型，不是一个真实的人。“他”是设计者通过对产品使用者的目标、行为、想法等等进行研究，再将这些要素抽象、综合成为一组典型的产品使用者的描述，用来辅助产品的决策和设计。\n \n一般来说，人物角色会包含一些个人的基本信息，家庭、工作、生活环境描述，与产品使用相关的具体情境，用户目标或者产品使用行为描述等等。一个产品通常会设计3～6个角色代表所有的用户群体。人物角色可以帮助我们把握关键需求、关键任务、关键流程，看到产品必须做的事，也知道产品不该做什么。《赢在用户》这本书对人物角色有非常详细的介绍，有兴趣的可以了解一下。\n当我们讨论到用户需求时，可以试试用“张超不需要这个功能”（假设你的人物角色叫“张超”），来代替“用户不需要这个功能”这种说法。这样就会显得更加的具体、形象，团队也能够很好地理解，避免争议。然后，你回过头来看看，你属于这些用户吗，你是“张超”吗？显然，产品经理和设计师们，都不是“张超”，也不是“张超”那样的用户。90%的情况是这样的！比如开发亲子产品的人，他自己可能连孩子都还没有。所以，你可以移情，代入典型用户的场景去思考，但千万不要把自己当成典型用户。\n说了不能把自己当成典型用户，于是很多人又进入了另外一个误区，那就是：完全听用户的。\n误区4：完全听用户的\n用户说什么就是什么，这种设计师就像是一个洗脚店的服务员，顾客说哪里不舒服，就按一下哪里，根据不去找原因、动机。当然，我并没有说洗脚店的服务员都这样，这只是一个比喻。\n我个人的观点，做设计并不是做服务。设计不是狭义的服务，我们的设计工作不是服务用户，更不是服务产品经理。狭义的服务，会被理解为对方想要什么，我就给什么，通过这种方式来获得对方短时、快速的满意。\n可用性大师尼尔森说“Don’t listen to users, watch users work”。意思是，我们不要光听用户嘴上怎么说，重要的是要去观察他们的行为。当用户跟你说，希望提供某一个功能的时候，你要去观察这些用户，他们有哪些特征、经验、场景和行为，以及期望得到什么效果。 我们不能只听用户说出来的，而且要多去了解为什么，多去观察他们有些什么样的行为，去分析用户的内在动机和原因。只有搞明白了用户需求，才有可能做出用户满意的产品。\nKANO模型定义了三个层次的需求：基本型需求、期望型需求、兴奋型需求。\n \n 基本型需求：\n是指用户认为产品必须要有的属性或者功能。不满足时，用户就会很不满意；满足时，他们也无所谓满意不满意。比如手机可以打电话、空调可以制冷、电脑可以连WIFI、看视频不要卡顿，这些都是基本的需求。\n期望型需求：\n要求提供的产品或服务比较优秀，但并不是必须的产品属性或者服务行为。有些期望型需求连用户自己都不太清楚，但的确是他们希望得到的。在市场调查中，用户跟我们谈论的通常就是期望型需求。比如，写文章要自动保存、上传大文件要支持断点续传、信号不好要支持自动切换片源，这些都是期望型需求，用户可以比较明确的说出来。期望型需求在产品中实现的越多，用户就会越满意；没有满意这些需求时，用户就会不满意。\n兴奋型需求：\n就是指超出期望的需求。当你提供一些让用户完全出乎意料的产品属性或者服务行为，并且让他们得益，他们就会非常兴奋，从而提高对品牌的忠诚度。比如海底捞会给戴眼镜的客人一块眼镜布、云音乐会根据你的口味推荐音乐给你、Mac电脑复制的文字可以在iPhone上粘贴，这些都是超出用户期望的需求，用户自己也不知道，更不会告诉你应该要有这些功能。\n超越用户期望的体验，才称得上好的用户体验。否则你的产品对用户来说，可能是可有可无，被替代性很高的。所以，要提升产品的用户体验水平，我们就需要特别关注，去挖掘那些可以超出用户期望的兴奋型需求。\n福特汽车创始人亨利·福特说，如果我当初去问人们需要什么，他们一定会说：我要一匹更快的马。用户的意见虽然重要，但是只问用户的意见是做不出突破性的产品的。请问，亨利·福特制造的汽车，在当时属于满足哪种类型的需求？兴奋型需求对吧，用户当时自己也不知道原来有一个叫汽车的玩意可以用来实现“快速从A地到达B地”的目标。\n需求的类型是会发生变化的。比如放到今天，“快速从A地到达B地”也许并不需要汽车，如果只是想要跟外地的同事开个会，用视频会议系统就可以了。所以，需要远程会议的人已经对汽车不再兴奋了。\n总结一下：对于基本型需求，我们要做的是确保万无一失，并且要让它非常可靠。平时可以用表格来帮助自己整理，避免做出“打不了电话的手机”这种无用的产品；对于期望型需求，通常是越多越好的，但是你可能要好好计算一下投入与产出比；对于兴奋型需求，因为用户自己也不知道，所以我们只能通过多观察、多分析，提高这方面的敏感度，不断推陈出新，定期给用户惊喜，他们会更乐意把你的产品推荐给别人。\n一旦每个需求都得到了明确的分类，我们就可以在需求收集的过程中对它们的优先级和可行性进行综合考量和排序，然后制定实施计划。\n说到“需求”，简简单单的两个字，却困扰了很多的设计师和产品经理。迷茫的设计师一边做一边猜，猜不对就改，改了还不对，回去再继续改。总会有人给你提各种各样的意见，你按他们的意见去改了，结果产品经理还是可能会拍桌子：完全不是我要的样子啊！\n从iPhone开始火了用户体验，用户体验又火了交互设计。但是很多人学习新东西还是喜欢找模板，生搬硬套。网上那些Axure教程都挺火的，各种屌炸天的五毛钱特效、动态面板，反正是应有尽有。\n我见过很多Axure软件操作的高手，他们画的原型看起来都很历害的样子。哎哟，还会动哦！但是当他们接到设计需求时，多数还是一脸茫然，或者总会遇到不断被要求修改修改修改这样的工作状态。\n我在面试的时候，像这种软件操作的熟练程度，一般是不看的。因为我要找的不是画原型和线框图的工人，而是有想法的设计师。\n \n不知道什么时候开始，多了一个我不是很喜欢的词：干货。什么是干货？就是听完一个讲座，或者看完一篇文章，得到一个回去马上就能使用的方法、技巧。比如我跟大家说，写文章的时候，你给标题加一个数字，对于提高点击率是有帮助的。就好像这篇文章的标题。哈哈哈哈。\n但是很可惜，我今天不是来分享干货的。 -_-凸\n我今天不会教大家怎么做需求分析，主题并不是“设计需求分析的4个技巧”。所以，只是想在这里跟大家分享一下，在我过去的工作经历当中，我做设计需求分析时，踩过哪些坑，也就是走过哪些误区，应该如何避免。这些坑，如果你也不幸踩过，可能你会感同身受；如果你还没踩过，要么是你太幸运，要么就是还没开始，总之该来的总是会来的。\n小技巧是很容易得到的，花点时间找一下就有了。但是，你能轻易得到的小技巧，别人也行啊。所以，小技巧算不上核心竞争力。建议大家回去还是要多啃几本专业的书，多做几个项目，又或是多找几个同行前辈交流交流，那样才扎实，才能得到真正是干货。\n要做好设计，就要搞清楚设计的需求。关于设计需求分析，的确是一门学问。在展开介绍几个误区之前，我想先跟大家说明一下什么是“设计需求”，这不是我自己创造的词汇。所谓设计需求，就是指需要设计师配合完成的需求，比如设计用户流程、用户界面这些都是设计需求。\n \n我认为一个产品的设计需求应该包括两个方面，一是业务，二是用户。所以，会同时包含业务目标和用户体验目标两个层面。符合设计需求的方案，一定是既满足业务目标，又满足用户体验目标的。 设计师在做需求分析的时候，第一个容易踩的误区就是：只关注用户需求，不关注业务目标。\n误区1：只关注用户需求，不关注业务目标\n在实际工作中，设计师接到的业务需求，大多数时候，可能都是类似这样的。比如，“把购买流程优化一下”、“课程页面加一个分享的功能”、“讨论区帖子要支持顶和踩”、“在消息中心提供清空操作”。说是需求，其实多半已经是一个解决方案了。完整的需求应该包含目标和期望，甚至是背景的描述。\n如果你只是想把这个工作任务快点完成，那么就会照着需求方的方案去做，完全不管背后的目标和期望。这样的事情做多了，充其量就是一个“努力的笨蛋”而已。这样很危险，对产品，对你个人来说，都很危险。\n对待业务需求，我们需要向对待用户需求那样，不断地问为什么。去了解原因、背景。比如，为什么要优化购买流程？现在的流程有哪些问题呢？我们的用户会分享什么样的内容到微信里边呢？做了这些事情，产品期望得到怎样的成果呢？并且，我们又要如何来衡量设计方案的效果呢？\n了解问题，往往比提供解决方案更加重要。爱因斯坦说：“如果让我1个小时解答一道决定我生死的问题，我会花55分钟来弄清楚这道题到底是在问什么。一旦清楚了它到底在问什么，剩下的5分钟足够回答这个问题。”\n了解问题，即知道了做这件事情的目的、原因、动机。目的通常是需求的出发点，而目标是期望的成果。之所以提出目的和目标两个概念，是因为现实中就是会有很多人把目的目标混淆。如果直接用目的来指导设计，是空的，不够具体，也可能和设计没有直接关系。比如，要达到“获得更多的注册用户”这个业务目的，只要多做做推广，多挂挂广告也是可以的。但“提高注册转化率”这个业务目标，就变得和产品设计有非常直接的关系了。\n对目标最有帮助的事情，就是最有价值的事情。设计前先确认清楚相关的目标和期望，先问问做这件事想要达到什么效果。如果想不清楚，就先花时间搞清楚，不要因为时间急就匆匆忙忙地开始。努力固然重要，但比努力更重要的，是走心和思考。思考是一件难度更高的事，所以许多人宁愿立马埋头苦干，任劳任怨，不愿意花时间多想。这种看似勤奋的行为，实质是懒惰的，懒到脑子都不愿意转一下。\n \n像提升PV、UV、用户数、转化率、留存率、活跃度这些，通常是产品类的业务目标。而像提高市场份额、百度排名这些则是市场类的业务目标。这些目标一方面来源于产品的定位、规划，以及业务目的；另一方面，这些目标也有可能来自于公司战略、用户的需求、数据的分析结果等等。\n作为设计师，我们不仅需要关注用户需求，还需要关注业务目标和相关的衡量指标，积极去思考如何将业务目标转化为用户行为。然后再去设计用户流程和界面。我们通过规划引导用户使用，来帮助产品达成目标。\n \n为了达成目标，通过设计需求的分析，给用户创造动机、排除担忧、解决障碍。其中，创造动机、排除担忧是为了让更多的用户有更强的意愿使用；解决障碍，是为了让用户的操作变得更加有效、高效、容易学习使用。只要我们完整思考了这三个方面的因素，就能够有效提升产品的用户体验，同时又能够帮助产品顺利达成业务目标。这是一件双赢的事情。\n用数据来监测产品，能让你了解到用户的使用情况，和产品的健康状态。数据和用户体验并不是对立的，如果产品的改进让用户觉得很有意义，那么数据指标自然就会上升；如果用户体验没有什么改变，就不能说你的改进很成功。\n数据目标可以让整个团队团结起来，大家围绕着一些清晰和有形的指标，各司其职。如果没有数据指标，就很难衡量。如果无法衡量，就无法增长。\n但是，数据没有办法告诉我们用户体验是否得到了改进。比如，你给消息中心增加了删除消息的功能，删除按钮的点击率很高，这并不能说明用户体验变好了。相反，很多用户删除了产品推送的消息，我们就需要好好想办法改进消息推送策略了。有些问题也不是光看数据就能发现的，比如你无法通过数据得知为什么有那么多人愿意彻夜排队抢购一只手机，因为品牌效应很难进行量化。所以，定性研究是一个非常好的补充。定量研究告诉你用户做了什么，定性研究帮助你搞清楚用户的感受，两者需要相辅相成。\n微信创始人张小龙在腾讯发表了一个内部演讲，说“KPI是副产品”，我非常赞同。好的用户体验超越用户期望，这种工作不是单靠KPI这种数据的东西可以指导的。团队首先应该有用户价值的导向，然后再来谈数据，谈KPI。KPI是副产品，但用好KPI并不会让团队辜负产品。\n当业务需求和用户体验取得了比较好的平衡时，我们设计的就是一个健康的、可持续发展的产品。这是一个系统的工作方法，也是所有设计师必需要掌握的技巧。更是设计师帮助产品、帮助自己实现价值的关键基础。\n业务分析的方法参见：《阿里干货！交互设计师如何进行业务分析？》\n误区2：需求分析是产品经理干的\n以前我曾经有过一段这样的工作经历：交互设计师如果觉得产品经理的需求不完整、不靠谱，就把需求打回去，要求产品经理重写。产品经理觉得交互设计师阻碍了产品的进展，交互设计师觉得产品经理需求不靠谱，相互埋怨。可是，没有谁是老板派来捣乱的，对吧？当两个角色相互不信任，就没有办法形成很好的合力。甚至，大家做这份工作都会觉得很吃力，工作体验很糟糕，更别指望能做出好的用户体验的产品了。\n到这里可能就有人就会说，那交互设计师和产品经理合二为一不就得了。可是我并不这么认为。在资源许可的情况下，我的建议是，交互设计师和产品经理两个角色还是分开设置比较好。因为设计师和产品经理的思维方式完全不同。\n \n设计师通常关注产品的实现层面，而产品经理通常关注产品的业务层面。业务层面的意思是，假如你是一个在线教育产品的产品经理，为了达到管理层制定的提升20%的用户活跃度这个目标，你最关心的并不是开发什么功能，要把界面做成什么样，而是思考怎么样筛选出一群人，让他们来建立学习的氛围。然后，再来制定一个个小目标和实现路径，协调各个专业领域的人来达成目标。\n所以，当产品经理在思考业务层的问题时，绝对不是功能是什么，界面应该做成什么样。而是思考如何打通业务、争取资源，建立产品的闭环，协调团队，帮助产品顺利达成目标。\n再具体一点的话，设计师和产品经理各自都会负责不同的事情。比如产品经理主要负责收集市场和用户的信息，确定产品的目标和方向；通过获取更多公司可用的资源，来制定实施路径和策略；通过协调不同的团队共同工作，促进目标达成。而设计师呢，主要职责是明确业务需求和用户需求，并确定相关衡量指标；通过提供可视化的解决方案供团队讨论决定，挖掘更多的可能性；通过建立和维护设计规范，来提升产品设计的品质和效率。\n总之，产品管理的目的，是为了让产品实现长期的用户和客户满意，保持市场竞争优势，把产品的商业价值发挥到最大。而交互设计的目的，是让产品和用户之间建立有机关系，有效实现用户目标和产品目标。两个角色有非常多的时候需要互补，但两个角色的思维方式完全不同，所以我的建议是交互设计师和产品经理两个角色还是分开设置比较好。\n对于设计师而言，如果你的工作是在产品经理确认需求之后才开始的，那么建议尽快调整过来。你应该在产品经理分析目标市场、思考产品策略的时候就开始介入，只有这样才能发挥设计的价值。在设计之前，对业务目标和用户体验目标的理解，不是别人可以代替你完成的。 很难想像，一个不了解需求的设计师，他能做出什么好设计。事实上，团队里每一个角色都需要理解用户需求，不只是产品经理、设计师需要。如果开发工程师不了解需求，没有提出问题，那么就会有更多的工作浪费。\n根据某些非官方渠道的数据统计，95%的产品团队没有设立专职的交互设计师，而70%的产品经理又是没有受过专业的交互设计训练的。所以，如果你的团队暂时没有交互设计师的话，也不要紧，设计需求分析的方法仍然有效。\n产品经理的需求该不该接？看这里：《交互设计师：帮你判断需求该不该接的五个小原则》\n误区3：把自己当成典型用户\n在工作中，当我们讨论用户需求时，常常会听到“我觉得”，而不是“我发现”、“我知道”。有的时候，我自己也避免不了，不自觉地就会这样描述：“我觉得用户不需要这个功能”、“我觉得用户会找不到”。\n我们也总是会听到建议说“你要去多体验体验这些产品”。可是，其实体验越深入，离典型用户就越远了。为什么呢？\n因为你的产品视角会阻碍你成为典型用户。并且，你根本就不是典型用户，你没有他的经历、没有他的想法、没有他的感受。尽管你可以假装成自己是用户，尝试用你的同理心，去感受、理解他们。但那样其实也顶多只是一个低成本，且效果一般的办法而已。\n人物角色其实是一个比较好的办法。人物角色，英文Persona，它是对目标群体真实特征的勾勒，是真实用户的典型。\n注意了，人物角色是真实用户的典型，不是一个真实的人。“他”是设计者通过对产品使用者的目标、行为、想法等等进行研究，再将这些要素抽象、综合成为一组典型的产品使用者的描述，用来辅助产品的决策和设计。\n \n一般来说，人物角色会包含一些个人的基本信息，家庭、工作、生活环境描述，与产品使用相关的具体情境，用户目标或者产品使用行为描述等等。一个产品通常会设计3～6个角色代表所有的用户群体。人物角色可以帮助我们把握关键需求、关键任务、关键流程，看到产品必须做的事，也知道产品不该做什么。《赢在用户》这本书对人物角色有非常详细的介绍，有兴趣的可以了解一下。\n当我们讨论到用户需求时，可以试试用“张超不需要这个功能”（假设你的人物角色叫“张超”），来代替“用户不需要这个功能”这种说法。这样就会显得更加的具体、形象，团队也能够很好地理解，避免争议。然后，你回过头来看看，你属于这些用户吗，你是“张超”吗？显然，产品经理和设计师们，都不是“张超”，也不是“张超”那样的用户。90%的情况是这样的！比如开发亲子产品的人，他自己可能连孩子都还没有。所以，你可以移情，代入典型用户的场景去思考，但千万不要把自己当成典型用户。\n说了不能把自己当成典型用户，于是很多人又进入了另外一个误区，那就是：完全听用户的。\n误区4：完全听用户的\n用户说什么就是什么，这种设计师就像是一个洗脚店的服务员，顾客说哪里不舒服，就按一下哪里，根据不去找原因、动机。当然，我并没有说洗脚店的服务员都这样，这只是一个比喻。\n我个人的观点，做设计并不是做服务。设计不是狭义的服务，我们的设计工作不是服务用户，更不是服务产品经理。狭义的服务，会被理解为对方想要什么，我就给什么，通过这种方式来获得对方短时、快速的满意。\n可用性大师尼尔森说“Don’t listen to users, watch users work”。意思是，我们不要光听用户嘴上怎么说，重要的是要去观察他们的行为。当用户跟你说，希望提供某一个功能的时候，你要去观察这些用户，他们有哪些特征、经验、场景和行为，以及期望得到什么效果。 我们不能只听用户说出来的，而且要多去了解为什么，多去观察他们有些什么样的行为，去分析用户的内在动机和原因。只有搞明白了用户需求，才有可能做出用户满意的产品。\nKANO模型定义了三个层次的需求：基本型需求、期望型需求、兴奋型需求。\n \n 基本型需求：\n是指用户认为产品必须要有的属性或者功能。不满足时，用户就会很不满意；满足时，他们也无所谓满意不满意。比如手机可以打电话、空调可以制冷、电脑可以连WIFI、看视频不要卡顿，这些都是基本的需求。\n期望型需求：\n要求提供的产品或服务比较优秀，但并不是必须的产品属性或者服务行为。有些期望型需求连用户自己都不太清楚，但的确是他们希望得到的。在市场调查中，用户跟我们谈论的通常就是期望型需求。比如，写文章要自动保存、上传大文件要支持断点续传、信号不好要支持自动切换片源，这些都是期望型需求，用户可以比较明确的说出来。期望型需求在产品中实现的越多，用户就会越满意；没有满意这些需求时，用户就会不满意。\n兴奋型需求：\n就是指超出期望的需求。当你提供一些让用户完全出乎意料的产品属性或者服务行为，并且让他们得益，他们就会非常兴奋，从而提高对品牌的忠诚度。比如海底捞会给戴眼镜的客人一块眼镜布、云音乐会根据你的口味推荐音乐给你、Mac电脑复制的文字可以在iPhone上粘贴，这些都是超出用户期望的需求，用户自己也不知道，更不会告诉你应该要有这些功能。\n超越用户期望的体验，才称得上好的用户体验。否则你的产品对用户来说，可能是可有可无，被替代性很高的。所以，要提升产品的用户体验水平，我们就需要特别关注，去挖掘那些可以超出用户期望的兴奋型需求。\n福特汽车创始人亨利·福特说，如果我当初去问人们需要什么，他们一定会说：我要一匹更快的马。用户的意见虽然重要，但是只问用户的意见是做不出突破性的产品的。请问，亨利·福特制造的汽车，在当时属于满足哪种类型的需求？兴奋型需求对吧，用户当时自己也不知道原来有一个叫汽车的玩意可以用来实现“快速从A地到达B地”的目标。\n需求的类型是会发生变化的。比如放到今天，“快速从A地到达B地”也许并不需要汽车，如果只是想要跟外地的同事开个会，用视频会议系统就可以了。所以，需要远程会议的人已经对汽车不再兴奋了。\n总结一下：对于基本型需求，我们要做的是确保万无一失，并且要让它非常可靠。平时可以用表格来帮助自己整理，避免做出“打不了电话的手机”这种无用的产品；对于期望型需求，通常是越多越好的，但是你可能要好好计算一下投入与产出比；对于兴奋型需求，因为用户自己也不知道，所以我们只能通过多观察、多分析，提高这方面的敏感度，不断推陈出新，定期给用户惊喜，他们会更乐意把你的产品推荐给别人。\n一旦每个需求都得到了明确的分类，我们就可以在需求收集的过程中对它们的优先级和可行性进行综合考量和排序，然后制定实施计划。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 8, "author": "Veyhunk", "title": "设计项目管理方法", "description": "设计项目管理方法基本论, 管理思想如何影响设计过程", "imageURL": "images/6.jpg", "text": "设计是用来解决问题。对于设计师来说这是再熟悉不过了，但是到底要解决什么问题本身就是一个问题。大家都会提问，但是如何提出有探索性的问题，是非常难的。牛逼项目往往从一个好问题开始。我在伦敦研究生一年中，都在研究如何找到研究问题，问题方向找对了，答案也更有方向了。\n设计流程是一个直觉与深思熟虑相融合的行动。这篇文章将根据一个现有案例来分析设计流程的每一个阶段，从定义一个的研究问题到获得创意到设计执行。在沿着这个方向走的同时，组建设计团队需要的是多方面的人才，例如项目管理，文案，策划，设计，商务等等。接下来要介绍的这个项目是MICA平面设计研究生的研究项目。这个项目是由设计师Jennifer Cole Phillips为客户Charlie Rubenstein所设计的，目的是提升对本地社区无家可归的人的关注，是一个社会性很强的项目。对于无家可归的人这个范畴来说，是可以涉及到的范围是非常广泛的，上到政府政策下到衣服穿着，设计团队需要做的是先明确设计目的，缩小研究的范围，创造一个核心价值点来传达设计理念。\n在2008年，设计团队在Baltimore城市访问了3419位居住空间特别受限的流浪汉。他们的研究问题是如何提高对这3419个没有住所的流浪汉的关注。设计团队根据这3419个人筹划了一场活动，单单只是针对了他们的住所问题。在这里必须插一句，一个设计解决一个问题就够了。这个项目的目的让在校小学生更好了解这一个群体。目的明确，受众清晰，下面是具体的操作方式。\n1. 定义问题：\n \n找问题的一个好办法就是采访。设计师通过与客户的访谈，和对洞察无家可归的人的内心需求来寻找切入点。有些客户和受众是不清楚自己需要做的是什么，作为专业的设计师，在客户或者受众访谈的过程中，必须具有敏锐洞察力，例如对客户和受众情绪的理解，从他们的姿势，动态，语速判断抓取当下的内容是不是客户在意的，是不是有价值。例如设计师在客户情绪激动的时候就抓到了几个有价值的信息：客户对现有的流浪汉服务非常不满意，政策十分单一而且不是每天都有能提供帮助，他并提出了希望设计一个以人为出发点的项目。客户觉得，他们这个项目在谈论的就是人，而且他们每个人又非常不一样，但如果他们尝试去理解每个人，他们来自哪里，他们的名字等等。客户希望做一个长达6个月的研究，采访他们每个人，而且不只采访一次，是一个长期过程，那么，设计师和客户将能慢慢了解他们的受众。\n \n设计思维导图是将调研过程中有用的信息整合在一起，不管是设计理念，核心词汇或者视觉元素等等。设计师以Homeless（无家可归的人）为核心出发，收集与其相关的内容和视觉元素，例如“家”元素就要钥匙，门把，墙，地板，邮箱等；无家可归的人的视觉形象是：粉笔标示，睡觉，睡袋，街道等；对于logo，家的logo有旅馆，家具，房地产等；对小学生的视觉logo应该是：吸引眼球的，新奇的，有时尚感的；所以对于将要设计的品牌logo设计方向的主视觉可以包含是：“家”“人”“手”“心”“抽象”等。\n品牌坐标轴是定位品牌一个有效方式，设置X,Y轴的属性后，将自身品牌在其位置标明出来，并与相类似的设计或者产品在同个坐标一起标记、对比，可以更好的拉开与现有设计的区别，这个方法在商业设计中也经常被用到。\n设计师做头脑风暴时选了三个词来思考无家可归的人的需求：“can”“want”“are”也就是他们能做什么，想做什么，他们是什么这三个问题，从而深入的研究受众需求。\n2. 获得创意：\n \na. 视觉脑暴：一个快速又有趣地获取视觉概念创意的方法。从一个视觉符号开始，如“房子”，设计师通过对房子的视觉形态不断演变，如多个重复的，扁平化的，三维的等等，这是相当于视觉上的头脑风暴。\nb. 视觉穷尽：设计师以“3419”为这次活动的主题名字，选取一系列不同的数字字体样式，把符合主题视觉感受的全部字体都找出来，摆在一起，挑选出其中最适合的字体视觉样式。\n3. 设计执行：\n \na. Mock-Ups：也就是我们常说的“融图”，对品牌设计师来说是再熟悉不过了。把设计稿做出精致的实物效果图，是作品打样前重要的一步，能更好的呈现出设计作品未来的真实样子。\nb. 设计师对现有字体的调整，在上一步视觉穷尽中，他们选择了字体DIN，但是一般字库的字体是比较中性的，很难完全匹配设计的需求，这时就需要设计师把握好前面几步总结好的设计调性，根据其调性来调整字体，使其风格、性格与设计理念相匹配。\n \nc. 设计师设计了海报和活页练习题来教育小孩关于Baltimore这个城市的流浪汉，同时告诉学生们他们能为流浪汉做什么。这是一套小工具的设计，里面还包含两个漏字板，两个枕头套，一瓶油漆和一把刷子，这些工具让让小学生们去创造他们的枕套海报，激发他们流浪汉现状的思考和如果睡觉没有床会是什么样的等等。\n \n设计是一个一直在持续的过程，在设计师设计出这套小工具后，他们开始测试，应用这套工具。他们在小学里举行“3419”这个活动，当小学生们用这套工具创造他们自己的作品时，设计师与他的目标受众进行了直接互动，而小学生们创造出来的东西，也直接变成了这个设计的最终视觉形象，是一个持续不断的设计过程。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 10, "author": "Veyhunk", "title": "设计中的排版建议", "description": "良好设计的版式是怎样的, 如何练就版式设计基本功", "imageURL": "images/7.jpg", "text": "人类在进化的过程中，一直本着安全第一的原则。对于事物表象的判断之后产生的心理感受，随着人类的进化一直伴随着的。出于安全第一原则，人类的天性会自动的根据物体的表现（形状、颜色等）来判断事物的危险程度。例如尖锐的器物与色彩斑斓的昆虫，都会给人警示的不安全感，我们可以看看公安或消防的警戒色带，皆是遵循了这样的心理。\n \n—————————————————————— one ———————————————————————————–\n图例一：\n \n以上提到，人类观看事物的心理活动，是第一时间先排除危险感，也可以说，第一时间是在寻找违和感。比如上图中的凤姐与天使拉宝贝照片对比。当我们看到凤姐时，我们大脑的第一反应是会先去寻找她脸上哪些部位破坏了整体美感，比如大嘴和眼袋，这也就是我们第一时间会注意到她嘴巴的原因。而当我们再看到天使拉宝贝时，我们则不会去思考到底什么使得她看起来很美。\n大学里有门课程，叫做”审美”。很多人都不理解为什么要学习审美，因为他们认为审美应该是天性和本能。希望通过我的第一个例子，大家能够明白，发现美不是本能，发现丑才是本能。因此”世界上不缺少美，只是缺少发现美的眼睛”！这句话，应该按照如上去理解。\n说的更加直白一点，人类对于事物的第一反应不是”审美”，而是”审丑”。\n—————————————————————— two ———————————————————————————–\n为何在开头我要花这么长的时间先去解释一下审美？\n因为，我们只有充分的了解到自己的心理活动的步骤，我们才有可能创造出具备人类天性美感的事物。也可以说，我们第一思路不应该是创造美，而是回避丑。\n说完审美之后，我们再来说说”设计”。\n这个问题应该是涵盖在设计话题之下。因此，我认为相当有必要将”设计”这个概念拿出来单独说一下。\n设计是什么？已经有很多各类型的解读。当然，我也有自己的一套解释。\n设计一词，我们首先应该作为动词去理解。\n特指通过人为的主观意识去控制事物，然后所产生的一系列动作，比如某某某设计了他的人生。在平面设计当中，又更具体的理解为，设计师通过人为主观的意识，去控制画面中的各类元素（构图、色彩、字体、字号等等），使之符合大众的视觉标准。\n对于设计本质的理解。\n无论是商业类设计，还是纯艺术类设计，它们的本质都是传达与表达。通过某种形式的媒介（可以是书籍、路牌广告、弹窗、报纸、杂志……），将创作者或者付费客户所希望表达的内容，用可视化的方式表达出来。\n所有失败的设计，定是违背了以上两点。\n要么，是设计师完全没有经过思考，从构图、用色、字体选择方面过于随意，导致画面完全不符合人们的视觉标准。这就是很多人会说，我从你的画面中根本看不出来设计的原因。\n要么，对于想要传达的内容含糊不清，导致看完之后不知所云。这一类的通病常见于学生与行业新人。他们思维的第一步不是思考需要表达什么，而是思考用什么样的形式去表达。\n——————————————————————three ———————————————————————————–\n现在开始进入正题答题环节了。\n第一章：\n纯中文字时，如何提高文字的识别度与美感？\n由于之前回答过一个类似的问题，并且两者关联性很大，因此在这里就不多做重复，直接给出链接：《经验分享！超实用的文本处理技巧》\n—————————————————————— four ———————————————————————————–\n第二章：\n中文与画面结合时，如何提高中文字的识别度与美感？\n题目中出现了一个很重要的关键词”排版”。\n这是个被用烂了的词，却极少有人理解其中具体含义。排版作为平面设计中的一种具体的手段。其实本质是对于画面中元素的关系的处理。（画面中的元素包括构图，颜色，字体等等。而关系，则指的是它们之间的距离，大小面积，色彩搭配等等）\n图例二：\n \n上图例子中，我通过文字的位置不同，来让大家知道这个所谓的关系到底是个什么意思。\n右图从视觉美感上来说，明显是优于左图的，其最根本的原因不在于字号的大小，而在于我上面一直在强调的关系。\n到底什么是关系？我们接着往下看！\n图例三：\n \n上图中，我已经用辅助线来说明了这个文字摆放在这里的原因。\n接下来，我们再看看我随手找的一些平面广告图中的文字摆放的位置。\n图例四：\n \n文字的摆放一定不是随心的，而是与画面中某些元素之间相辅助的。\n图例五：\n \n这样的关系，不只适用于文字与画面，更涵盖了画面中所有出现的图片元素。\n以上我所列举和总结的这些，在一个行业老手看来，早就是一种习惯性的行为了。如有学习欲望的同学，请根据以上提示，自行翻看各种杂志与网络上的平面广告设计。\n第一次总结：\n有时候文字不美，别怪文字不好看，有可能是你没放对地方！找到通过寻找元素之间的关系，你会发现，文字应该摆放在什么位置。\n—————————————————————— five ———————————————————————————–\n上面所举例子，在论证文字要想好看，位置很重要！那么接下来，我们再进一步看看，如何变得更加贴切观看者的心理感受！\n图例六：\n \n上图里的内容，都是一样的，但是选择了不同的字体。各位可以从自己的心理感受上判断一下，哪一个看起来口感会好一些。\n从心理感受上来说，右边的字体，会给人更愿意食用的感觉。造成这样不同感受的原因就在于字体的衬线上。\n图例七：\n \n再看看以上，哪一个字体更适合男人，哪一个字体更适合女人？\n通常来说，食品、女性用品、儿童用品，以及一些消费群体为年轻化的产品，或者产品特质需要给人一种亲切感受的，在字体的选择上，更适合一些有弧线，没有衬线，并且字形相对柔和一些的字体。（我这里说的是大多数情况，也有个别案例，不遵循这个规律，在此就不展开说明了）\n图例八：\n \n我们继续来看看相同文字，不同字体造成的心理感受不一样的例子吧。\n图例九：\n \n我们再来接着做一组比较。上图中的文字，哪一个更贴合画面意境？\n第二次总结：\n没有不好看的字体，只有不合适的字体。在选择文字之前，请务必仔细的思考一下产品或画面的特性。\n—————————————————————— six ———————————————————————————–\n以上讲了两个观点，一是文字不要乱摆，二是字体不要乱选。现在让我们翻过头来，继续把前面第二章开头所说的，”版式”的这个概念继续的深入说一下。\n中文字，我们先不说那些被特别设计过的文字，比如下面这个：\n \n我们只说，电脑直接打出来的文字。\n在平面设计中，文字要想搭配的好看，只需要遵循四个字——”方方正正”即可。\n图例十：\n     \n我相信，以各位的智慧，已经不需要我在来继续讲解了吧！——————————— seven ———————————————–\n最后总结：\n在平面设计中，无论是文字也好，图形也好，色彩也好，他们都是服务于主题的。要想突出中文的美感，无论是字体、字号、色彩、包括拜访的位置，都需要全方位的来考虑。", "datetime": "2016-07-02 23:23:23", "$edit": false }, { "id": 9, "author": "Veyhunk", "title": "Logo创作过程", "description": "Giorgio12 设计工作室设计思想, Logo设计的5个步骤", "imageURL": "images/8.jpg", "text": "Logo无处不在，Logo能够起到品牌宣传、获取消费者认知的作用。Logo的核心意义是，通过简明扼要的品牌形象设计，勾勒出品牌的核心精神，让用户将Logo与企业完美的联系到一块。\nLogo和品牌的关系是相辅相成的，好的Logo能够有效的支持产品和企业形象，而好的企业形象能让Logo更加深入人心。\n时代一直在变，Logo设计出现了风格多样、种类繁多的大局面，挑战也与以往不同了。\n设计师该要如何打造优异的原创Logo作品？设计师要如何在快速创作的同时保证Logo的质量？\n本文，将致力于讲解Logo设计中的基本原则和专业性建议，耐心读完本文，你的Logo设计将会有质的飞跃。\n准备工作\n01. 研究用户\n \n好的Logo设计不光意味着图像优美——还必须起到品牌传达的作用。\nLogo设计，视觉是第一点。还要注意的是，要思考如何通过视觉元素来宣传推广品牌形象。因此，Logo设计的第一步就是要研究面向群体，研究他们是如何看待品牌的，研究他们对什么感兴趣。\n越早研究用户越好，这样就能避免出现根本问题，而且信息传递务求简洁、清晰、到位。\n02. 沉浸式设计：深入品牌\n \n回归到过去的本质，这是Logo Design London的设计方法\n在开始绘制草图之前，花点心思去研究一下你的客户，无论是档案、历史还是成功案例都可以。你要搞清楚：他们是谁，他们做什么，他们想要达到什么目的。\n多看看他们之前的Logo设计，你扪心自问一下，为何他们现在不用这些Logo了？是企业战略改变了？还是需要一种崭新的企业形象？\n列出一份清单，根据客户的具体情况，列出”必须要有的元素”和”应该极力避免的错误”\n“多看看客户之前的Logo，浏览客户自成立以来的设计”这是Logo Design London的Martin Christie给出的建议。”如果你能深入探究客户的过去，探索他们在发展路途上的经历，你就能发现企业精神的本质，将心比心，你会把这个项目当成自己公司的项目，本源设计，同时也会得到很多乐趣，让你的设计工作更有灵感，也更得心应手。”\n03. 旧草图有大用\n \nMartin Christie还说，你可以看看之前已经存在的设计的草图，能够提供很多有用的信息。\n“每款设计的背后，都可能有一打的草图备选方案，只是最终只确定了一款，”Martin Christie还说”这些草图很有价值，一个都不要拉下，看看前任设计时是怎么想的，你可能会获得更多的设计思考视角。”\n“而且你自己的、之前的草图落选方案也很有价值，对于之前的客户不适合，可能对于现在的客户就很适合。仔细审阅一遍过去的设计，没准就有你想要的点子。”\n04. 深入研究\n \nLogo Moose是个非常不错的Logo设计资源网，可以用来做研究。\n网络研究的两个极佳切入点：Logo Moose 以及 Logo Gala.不过不要无休无止的研究，要把握好停止研究的时机，只要获取了想要的信息，迅速进入下一步。可以看看相关的Logo设计，观察他们的得与失，可以收集50个相关的设计，比较一下。\n如果还在为创意而苦苦思索，那么不妨翻翻词典，看看词典上是怎么解释这个单词的含义；或者在Google上搜索一下图像，看看是如何进行视觉传达的；也可以翻翻之前的草图本，琢磨一下之前未实现的理念能否在此次设计中付诸实践。\n05. 不要模仿\n我们都有自己的设计偶像，我们总是忍不住要模仿他们的风格一番。有人说模仿是一种最深沉的赞美。然而，这终究是一种懒惰的借口，这会谋杀你的创意。\n问你自己，你喜爱的风格真的适合你的客户需求吗？非得要用Saul Bass 70年代的设计风格吗？\n06. 别一味听从客户的意见\n客户的意见不代表是命令。可以简单的看看客户的意见，对于其中含糊其辞的地方要询问。Logo设计”永远是符号化的”、”永远应该是令人感到印象深刻的”，这是客户的两大”陈词滥调”。\n凤姐确实令人印象深刻，但是你觉得和谐吗？设计总得现实一点，找到贴切的切入点进行信息传递。Logo设计是需要符号化，是需要令人感到印象深刻：但是必须要贴切。\n怎么办？将你的专业知识通俗化，幽默风趣的向客户解释，为什么这样行不通吧。\n07. 情绪板\n在做完所有的准备工作和研究之后。需要制作一个情绪版，用来进行设计的最终定位和价值规划。通过情绪板来进行详尽的分析。先贴出一些相关的设计，然后逐条分析，撕去不合适的，在旁边写下不合适的理由，最后利用情绪板来作为设计指导吧！\n最初的工作\n08. 画草图\n \n打开电脑前最好能有详备的草图，拿出你的纸和笔吧！图像来源：\nwww.gogetcreative.co.uk\n在深刻理解用户需求，知道要传达什么信息后，我们可以开始着手草图绘制：最好用笔和纸，这样更放松，灵感也会更多，对细节的把握也更深刻。\n虽然说都习惯直接用计算机开工，但是Ben Powell建议你不要着急。”你一般怎么开始，先用计算机还是先用纸笔？在使用PS之前试着用纸笔画画草图会帮助你攫取灵感。（草图）不必画的太过精细，只要能够理解就好。”\n09. 创建矢量图\n \n创建矢量图是Logo设计的中期任务。图像来源：\nBen Powell atwww.gogetcreative.co.uk\n草图完工后，打开计算机，将草图更规范的画在坐标纸上。使用矢量图这样就能将Logo很好的保存下来。Illustrator是很好工具，矢量图缩放也不会损失质量。\n10. 使用智能对象\n将矢量图拷贝到PS中，转换为”智能对象”（这样也不会在缩放时损失图像质量）,可以在PS中进一步修改，添加其他元素。\n如果你的Logo设计基于屏幕，那么一定要注意字体和线条。要考虑到不同尺寸、高宽比不同的显示器上Logo的显示效果。\n确定字体\n11. 审慎设计字体\n \n微软的新Logo看起来很纯净，字体功劳不小。\n很明显，好的Logo要依托字体来塑造风格。两种选择：自己设计，或者使用别人的。\n如果使用自定义字体，那么不要设计的太跟风，因为潮流只是一时。保持字体设计的辨识度和简约性。要根据你需要呈现的单词来设计字体，比如说”多彩的(colorful)”可以将字体设计的五颜六色一点——虽然大多数情况下，简约的字体百搭，但是如果你的创意比简约风格更好，那么用你自己的风格。\n12. 下载字体\n不一定要自己设计，也可以用别人的。\n修修补补之后，就可以使用他人设计的字体，应用到你的Logo设计中。可以对字体进行优化，以便更符合设计。\n13. 花哨的字体：金絮其外败絮其中\n不要为了突出Logo而使用花哨的字体。这种字体一般很廉价（便宜没好货，这就是为什么这种字体一般是免费的）。要专业，如果要买字体，那么就别怕花钱。\n大多数花哨的字体只是流行一时，而且弱爆了，大多使用在流行文化（一时流行）和廉价商业中。还是选用经典、简约的设计为好。\n14.让字体和品牌形象相符\n字体的意象（字重、倾斜度、衬线所带来的力量感、运动感、优雅感）必须与品牌形象相符合；怎样匹配，是Logo设计中字体部分的成败关键。\n15. 纯字体Logo\n \nJiyoung Lee为工业建筑公司设计了这款字体风格的Logo\n也可以通过纯字体的Logo设计来打造一种力量感和凝聚感。\n可以通过这些文章来研究下字体设计。\n推荐！字体设计基础：字由心生\n50个PS究极の奥义字体设计教程\n字体设计：达人入门篇\n然后看看下面这些文章，你会了解当下最流行的字体。\n值得设计师下载的55套顶尖英文字体\n35个风格迥异的中文字体设计作品欣赏\n妙用空间\n16. 合理设计，物尽其用\n \nThe British Council中利用小圆盘将整体很巧妙的结合在一起。\n很多设计书籍会专门讲述设计中的空白区域。该区域环绕在Logo周围，不含有内容，用以突出或者整合设计元素。\n当进行Logo设计时，需要仔细考虑这一区域的运用。不能喧宾夺主，也不能一点作用都不起。\n17. 留白之美\n \nFedex中E和X之间的箭头，你注意到了吗？\n优秀的Logo设计会利用留白区域暗藏信息，既能更合理利用元素，又在不增添的基础上保证了简洁。比如说经典的Fedex的Logo，E和X之间的箭头象征着这家快递到货迅速，从而让用户放心。这种小细节往往让用户莞尔一笑，从而对品牌产生兴趣。\n留白怎么设计？看看这里\n我们为何要在设计中重视”留白”\n18. 可别画蛇添足\n上述的小技巧都很好，但是不要太贪心，加入太多元素，这样设计就显得”尾大不掉”，冗余信息太多，会让用户感到繁杂。要简洁，始终要记得：你的目标是解决用户的商业问题，你的设计是在他们的用户之间不断传递。\n图形设计\n19. 设计要看起来积极向上，不能过于消极\n \nTwitter的Logo设计象征着翱翔天际，让人感受到力量、动感和向上的精神。\n考虑好图像的角度、位置、尺寸，试着加入一点动感，让人感受到活力。\n比方说一条跳跃的金枪鱼，让人感到非常的有生机，但是如果你设计的不是太好，图像过于静态，让人感觉像一条死鱼。方向也很重要，要记住。\n20. 文化差异\n西方文化，左退，右进。各个国家都有自己的禁忌，要事先了解，免得让你的设计出笑话。\n21. 还要考虑黑白色调\n很多情况下，Logo只能以黑白的形式体现，因此，需要考虑到Logo在黑白色调下的功能性。这就意味着元素之间的对照关系要强烈，即便移除了色彩，也能照样起作用。\n22. 可以设计的实验性一点\n \nCut & Splice的Logo设计与众不同，令人印象深刻。\n不要被常规局限。例如Luke Prowse就设计了Cut &Splice这种令人印象深刻的Logo，非常具有实验性。\n你看，每一副图像中图形色彩均不一样，让人感受到一种鲜活的创造力。\n \nCut & Splice的 logo 设计变换无穷\n保持简约，保持现代感\n23. 不要使用超过两款以上的字体\n当然，凡事都有例外。不过最好不要使用超过两种以上的字体，否则设计会看起来很凌乱。\n24. 黑白通吃\n \nYouTube的Logo设计很棒，无论背景深还是浅，都能被快速辨认出\n如果你的Logo在白色背景下看起来很棒，客户会很高兴。但是没准一年后，客户回头来找你，说他们又有了新产品，根据产品定位，产品背景色必须是黑色的。为了避免重复工作，最好Logo设计的能够适应多种背景。\n25. 与时俱进\n紧密关注当下Logo设计趋势可不意味着跟风。你需要了解当下流行什么、发生了什么，这样便能打破规则，创造个人风格。想知道Logo设计中正流行的风格吗？请看 this article.\n \n26. 减法设计\n \nLuke Prowse给Tempestra Underwear设计的Logo简单，又能唤起用户的情绪。\n减法设计的目的是去除设计中的”赘肉”\n你可以不断的想”这个Logo还能少点什么呢？”，”少了之后带不带感？””去掉了xx之后，是不是看起来更简洁了？”\n \n随着时间的推移，大部分品牌的Logo都在简化——Wendy最近的重设计就是个例子。\n27.怀疑既是否定\n如果不能合理的说明某元素在设计中的作用，那么最好删除该元素。当你的Logo简约到无法再简化的时候，你的设计肯定最接近完美。\n28. 不必面面俱到\n只需突出最出彩的一点即可：Logo不必面面聚到，不必阐述公司的历史，也不必完整阐述产品特点。电脑公司的Logo的图像不一定要是电脑（苹果就不是），餐馆的Logo设计不一定要和食物关联(麦当劳）。简单就好。\n29. 分合有度\n \nNike的Logo设计很不错，标语和Logo既能够独立使用，结合在一块效果也极佳。\n很多Logo设计需要和标语相结合。比如说Nike，Nike的”钩子”和”Just Do It”经常一起使用。不过当他们独立使用时，效果也不错。\n也就是说，有时候，设计Logo图像时，最好将图像设计的可以”独当一面“，即便没有标语也能很好的诠释品牌。标语也是同样的道理。\n \n30. 响应式Logo设计\n \n网页设计中的响应式设计对于Logo设计来说，也是极好的。\n如果你的Logo需要在网页和应用中”工作”时，最好考虑一下响应式问题。简单的缩放可不是好的解决方案。因为缩小的情况下，需要考虑到辨识度问题，会不会小成一团模糊的圆，用户什么都看不到？放大的情况下，会不会显得太空，需不需要再加入一点细节？符合上下文语境吗？可以看看 Anthony Calzadilla的this demo ，你会了解更多。\n功能性\n31. 创建尺寸不同的版本\n \nLogo设计需要考虑到不同的应用场景. 图像来源： www.gogetcreative.co.uk\n你的Logo看起来很美，很炫目…但是仅仅限于你的24寸显示器上。要是放在T恤胸口会怎样？名片呢？\n因此，要有不同尺寸的版本。放大缩小你的Logo，看看在不同尺寸上的细节。\n32. 灵活多变\n客户的需求多种多样，有的要求能够缩放，有的要求Logo中的元素能够分解使用，还有的要求可以工作在黑白色调下。因此你的Logo设计需要灵活多变，无论是报纸、手机还是电脑，都能起到作用。\n可以打印出多版本的Logo，贴在墙上，横向比较一下，看看有没有可以改进的，哪些是可取的。\n33.带上你的Logo产品线去见客户\n电脑版、手机版、T恤版、名片版、黑白版、分解版。\n带上你的Logo产品线去见客户，他们看到一系列的Logo肯定会很高兴。\n \n \n你的Logo设计应该跟棉线一样，可以编制出多种多样。\n嗯，服饰制造商的Logo设计尤其要注意这一点，因为多彩。\n34. 高瞻远瞩\n \nTimes Newspaper的重设计\n出于品牌价值的考虑，很多Logo会一直使用很多年，因此不要使用一时流行的字体和设计风格。也不要太贴：想想丰田，一开始主做缝纫机，后来改行做汽车，要是你按照缝纫机的特征进行Logo设计，那么你的Logo离被取代不远了。\n因此，Logo设计一定要高瞻远瞩，要经得起时间的洗礼。想想亘古不变的是什么？尽量打造经典。\n商业考量\n35. “Logo”和”品牌”之间不能太隔离\n \n2012伦敦奥运会的Logo设计\n将Logo和品牌混淆，这是常见的错误。\nWolff Olins的2012奥运会Logo设计饱受非议 ，大家都认为Logo设计的太隔离：首先是Logo图像本身便有一种分离感，而且又不能和标语很好的结合。\n这，是设计Logo时需要注意的问题。\n36. 要搭调\n \n字体的三种性格——权威，友好，充满娱乐性\n倘若你是个时尚爱好者，你进入了一家时尚资讯网，里面使用了很严肃的衬线字体，布局也很死板。你会继续浏览吗？答案应该是否定的。\n设计要和内容搭调，同理，Logo设计也是如此，应该用合理的设计培养用户的信任感。\n反馈\n37. 把你的Logo设计给周围的人看看\n \n完稿！你松了一口气，感觉很满意。没准上面这个Logo的设计师设计完也是这么想的，于是乎，他就闹了笑话。完工后把你的设计给周围人看看吧。不同的人看事物的角度都不一样，没准他们能够提供良好的建议。你自己也要反复，不同角度的看看你的设计。\n你不想犯上面这种错误吧？赶紧检查设计吧！\n什么？你居然觉得搞笑？好吧，看看这个！\n那些令人无法直视的LOGO设计\n38. 坚持自己的设计\n \n当然，用户的意见也是很重要的图像来源: Ben Powell at www.gogetcreative.co.uk\nBen Powell 曾说: “客户的意见很有价值，但一定要搞明白：你才是设计师，他们雇佣你是以设计师的身份，而不是上行下效的美工。”\n39. 询问客户意见要专业\n当你的Logo设计完工时，不要询问客户一些含糊不清的问题，例如”你觉得怎样？”、”你喜欢它吗？”\n你应该这么问”看起来简明扼要吗？”、”能够传递品牌核心价值吗”如果他们尴尬的不回答，说明他们不喜欢，一定要问的专业，要从设计的角度，通俗的询问他们的意见。\n40. 国际化\n尽可能的把你的作品展示给不同国家的人，尤其是那种国际化品牌的Logo设计。\n你需要了解你的Logo设计是否会和民族文化和地区习俗产生冲撞。\n例如1998年的Nike Air Bakin的”Air”写的就有点像阿拉伯文化的”Allah”(安拉），这就冒犯了阿拉伯人。\n41. 小心内涵\n \n慧俪轻体(一协助欲减肥者减肥的机构)，偏偏有人能从其中看出个twat，好YD。。。(邪恶的人自行百度twat吧）\n人类越来越YD了，不是吗？什么”小荷才露尖尖角”、”红杏一枝出墙来”、”曲径通幽处，禅房花木深”都能被一些混蛋想歪，因此小心你的设计”内涵”了！\n42. Logo重设计刚开始不要抱太大期望\n我们做了一个小调查，就是Logo重设计后，大部分用户都会觉得没以前的好。没关系，大体上不是你的设计问题，是由于突然转变让用户无所适从。慢慢的他们就会使用新Logo了。\n风格指南\n43. 创建一个Logo风格指南\n \nThe Channel 4 的风格指南诠释了Logo设计的细节，告诉大家应该和不应该之处。\n风格指南讲述了Logo的种种：从布局、限制、字体、背景再到色彩。也是很好的展示。可以看看这份指南\nChannel 4 style guide\n44. 列出配色方案\n风格指南应该包含Logo设计中的多种配色方案。要在插图下注明潘通色码，分解为CMYK和RGB色值。配色方案包括：白色背景下单色Logo、白色背景下多色Logo、黑色背景下单色Logo、黑色背景下多色Logo以及图像为背景的情况下，单色和多色的Logo。\n45. 列出最小尺寸\n有时候一款Logo如果缩小，辨识度和冲击力会变得很差。因此要在风格指南中说明Logo的最小尺寸。并列出多种尺寸方案。\n46. 写出布局建议\n很多Logo风格指南不会涉及到布局问题，但是布局很影响Logo的功效。例如如果把Logo放在文本的左边会比右面好一点。\n47. 写出关于空间的建议\nLogo周围的空间也很重要，也会影响到Logo信息的传达。例如Logo下面应该留出Logo宽度的四分之一，这样看起来比较舒服。\n48. 写出应该避免的问题\n列出应该避免的问题，列出与Logo冲突的一些情况。风格指南的意义在于方便设计师和客户：让设计师的作品保持最大限度的原意，让客户更有效率的使用Logo。\n进一步的探索\n49. 请下载Logo设计流程表\n \n这将会帮助你规范设计流程\n还是不明白？没关系你可以按照这本书按部就班的来。\nRight click this link to download the logo design flowchart(PDF)\n50. 拓展阅读", "datetime": "2016-07-02 23:23:23", "$edit": false }]